#include <stdio.h>

//打印练习
int main(){
    int k=1234;
    float f=123.456;
    printf("123456789\n");
    printf("%d\n",k);
    printf("%6d\n",k);//k的值有4列小于6列，在值的左边补2列空格；如果k的值为12则输出为□□□□12	□□1234
    printf("%2d\n",k);//k的值有4列大于2列，不补空格原样输出	1234
    printf("%06d\n",k);//空格用0替代	001234
    printf("%.6d\n",k);//空格用0替代	001234
    printf("%-6da\n",k);//右补空格，	1234□□a
    printf("%f\n",f);//f的值有7列	123.456001
    printf("%12f\n",f);//f的值有7列，再加上输出时补的3个0共有10列，小于12列则在值的左边补2列空格	□□123.456001
    printf("%12.6f\n",f);//f的值有7列，再加上输出时补的3个0共有10列，小于12列则在值的左边补2列空格	□□123.456001
    printf("%2.6f\n",f);//f的值有7列，再加上输出时补的3个0共有10列，大于2列则输出时在值的左边不补空格，原样输出	123.456001
    printf("%.6f\n",f);//f的值有7列，再加上输出时补的3个0共有10列，大于2列则输出时在值的左边不补空格，原样输出	123.456001
    printf("%12.2f\n",f);//f的值有7列，小数位有3列大于限定的2列则小数位只取2列并对第3位进行四舍五入；那么要输出的值就是123.46，总宽度为6列，则在输出时值的左边就要补6个空格	□□□□□□123.46
    printf("%12.0f\n",f);//输出的宽度为12列其中小数为0列（就是不输出小数，注意四舍五入）	□□□□□□□□□123
    printf("%.0f\n",f);//不指定宽度，小数占0列（无小数输出，注意四舍五入）	123
    printf("%012.6f\n",f);//	00123.456001
    printf("%-12.2f\n",f);//左对齐右补空格	123.46□□□□□□
    printf("%f%%\n",12.5);//“%%”只输出一个“%”	12.500000%
    printf("%e\n",f);//	1.234560e+002
    printf("%13e\n",f);//	1.234560e+002
    printf("%13.8e\n",f);//	1.23456000e+002
    printf("%3.8e\n",f);//	1.23456000e+002
    printf("%.8e\n",f);//	1.23456000e+002
    printf("%13.2e\n",f);//	□□□□1.23e+002
    printf("%13.0e\n",f);//	□□□□□□□1e+002
    printf("%.0e\n",f);//	1e+002
    printf("%013.2e\n",f);//	00001.23e+002
    printf("%-13.2e\n",f);//	1.23e+002□□□□□
    printf("%g\n",f);//	123.456
    printf("%5g\n",f);//	123.456
    printf("%10g\n",f);//	□□□123.456
    printf("%g\n",123.456789);//	123.457
    printf("%s\n","abedefg");//		abedefg
    printf("%10s\n","abedefg");//		□□□abedefg
    printf("%5s\n","abedefg");//	实际输出的列数大于5列就原样输出	abedefg
    printf("%.5s\n","abedefg");//	只输出5列	abcde
    return 0;
}


